tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "null-dev/firefox-profile-switcher"
tap "oven-sh/bun"
brew "fish"
brew "fnm"
brew "gh"
brew "git"
brew "jq"
brew "mas"
brew "pkgconf"
brew "xz"
brew "starship"
brew "stow"
brew "trash"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "1password"
cask "blackhole-2ch"
cask "claude"
cask "discord"
cask "figma"
cask "firefox"
cask "font-metropolis"
cask "font-monaspace"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "mullvad-vpn"
cask "notion"
cask "slack"
cask "steam"
cask "tableplus"
cask "tailscale-app"
cask "telegram"
cask "the-unarchiver"
cask "tower"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "Deliveries", id: 290986013
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Keyboard Keyboard", id: 1128271725
mas "NepTunes", id: 1006739057
mas "Numbers", id: 409203825
mas "uBlock Origin Lite", id: 6745342698
mas "WhatsApp", id: 310633997
vscode "adamwalzer.string-converter"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "amodio.toggle-excluded-files"
vscode "antfu.iconify"
vscode "antfu.slidev"
vscode "anthropic.claude-code"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "henriiik.vscode-sort"
vscode "jafd.knockoutjs-templates"
vscode "johnpapa.vscode-peacock"
vscode "jtr.vscode-position"
vscode "mechatroner.rainbow-csv"
vscode "midnightsyntax.vscode-wrap-console-log"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "orta.vscode-twoslash-queries"
vscode "oxc.oxc-vscode"
vscode "richie5um2.vscode-sort-json"
vscode "sdras.vue-vscode-snippets"
vscode "simonsiefke.svg-preview"
vscode "skyapps.fish-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wmaurer.change-case"
vscode "ybaumes.highlight-trailing-white-spaces"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zengxingxin.sort-js-object-keys"
