# Mozilla CA certificate store
brew "ca-certificates"
# General-purpose data compression with high compression ratio
brew "xz"
# Browser automation CLI for AI agents
brew "agent-browser"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# CLI helps develop/deploy/debug apps with Docker and k8s
brew "devspace"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Virtual Audio Driver
cask "blackhole-2ch"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-metropolis"
cask "font-monaspace"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source screen recorder built with web technology
cask "kap"
# Voice-to-text transcription and paste tool
cask "kitlangton-hex"
# VPN client
cask "mullvad-vpn"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Git client focusing on power and productivity
cask "tower"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Apple Configurator", id: 1037126344
mas "Deliveries", id: 290986013
mas "Hand Mirror", id: 1502839586
mas "Keyboard Keyboard", id: 1128271725
mas "NepTunes", id: 1006739057
mas "uBlock Origin Lite", id: 6745342698
mas "WireGuard", id: 1451685025
vscode "adamwalzer.string-converter"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "amodio.toggle-excluded-files"
vscode "antfu.iconify"
vscode "antfu.slidev"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "henriiik.vscode-sort"
vscode "ilich8086.coldfusion"
vscode "jafd.knockoutjs-templates"
vscode "johnpapa.vscode-peacock"
vscode "jtr.vscode-position"
vscode "mechatroner.rainbow-csv"
vscode "midnightsyntax.vscode-wrap-console-log"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "orta.vscode-twoslash-queries"
vscode "oxc.oxc-vscode"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "sdras.vue-vscode-snippets"
vscode "simonsiefke.svg-preview"
vscode "skyapps.fish-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "webpro.vscode-knip"
vscode "wmaurer.change-case"
vscode "ybaumes.highlight-trailing-white-spaces"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zengxingxin.sort-js-object-keys"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
