tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "null-dev/firefox-profile-switcher"
brew "cmake"
brew "ctop"
brew "exa"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "xz"
brew "git-filter-repo"
brew "go"
brew "jq"
brew "jsonpp"
brew "mas"
brew "protobuf"
brew "pyenv"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "trash"
brew "wakeonlan"
brew "wget"
brew "yt-dlp"
brew "zoxide"
cask "1password"
cask "arc"
cask "blackhole-2ch"
cask "calibre"
cask "discord"
cask "eloston-chromium"
cask "figma"
cask "firefox"
cask "font-metropolis"
cask "font-monaspace"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "kap"
cask "mullvadvpn"
cask "notion"
cask "parsec"
cask "slack"
cask "steam"
cask "tableplus"
cask "telegram"
cask "the-unarchiver"
cask "tower"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Balance Lock", id: 1019371109
mas "BetterSnapTool", id: 417375580
mas "ColorSlurp", id: 1287239339
mas "Deliveries", id: 290986013
mas "Draw Things", id: 6444050820
mas "GarageBand", id: 682658836
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Keyboard Keyboard", id: 1128271725
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "NepTunes", id: 1006739057
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tweetbot", id: 1384080005
mas "WireGuard", id: 1451685025
vscode "aaron-bond.better-comments"
vscode "adamwalzer.string-converter"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "alexdima.copy-relative-path"
vscode "amodio.toggle-excluded-files"
vscode "antfu.slidev"
vscode "antfu.unocss"
vscode "ardenivanov.svelte-intellisense"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bmalehorn.vscode-fish"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "cmstead.js-codeformer"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "henriiik.vscode-sort"
vscode "jafd.knockoutjs-templates"
vscode "johnpapa.vscode-peacock"
vscode "mhutchie.git-graph"
vscode "midnightsyntax.vscode-wrap-console-log"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "mrmlnc.vscode-scss"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "nuxt.mdc"
vscode "orta.vscode-twoslash-queries"
vscode "phoenisx.cssvar"
vscode "prisma.prisma"
vscode "richie5um2.vscode-sort-json"
vscode "simonsiefke.svg-preview"
vscode "skyapps.fish-vscode"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "wmaurer.change-case"
vscode "ybaumes.highlight-trailing-white-spaces"
vscode "yoavbls.pretty-ts-errors"
vscode "zengxingxin.sort-js-object-keys"
