tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "act"
brew "colima"
brew "coreutils"
brew "ctop"
brew "docker"
brew "docker-credential-helper"
brew "fish"
brew "fnm"
brew "gh"
brew "gist"
brew "git"
brew "git-filter-repo"
brew "go"
brew "mas"
brew "mkcert"
brew "nss"
brew "starship"
brew "tree"
brew "vim"
brew "wakeonlan"
brew "youtube-dl"
cask "1password-beta"
cask "1password-cli"
cask "discord"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "notion"
cask "parsec"
cask "steam"
cask "tableplus"
cask "telegram"
cask "the-unarchiver"
cask "tower"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
mas "BetterSnapTool", id: 417375580
mas "Deliveries", id: 290986013
mas "NepTunes", id: 1006739057
mas "Tweetbot", id: 1384080005
