tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "miralize/tap"
brew "act"
brew "bit-git"
brew "ctop"
brew "fish"
brew "fnm"
brew "gh"
brew "gist"
brew "git"
brew "go"
brew "mas"
brew "mkcert"
brew "nss"
brew "python@3.7"
brew "starship"
brew "tree"
brew "youtube-dl"
cask "docker"
cask "docker2"
cask "epoccam"
cask "figma"
cask "figmadaemon"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "microsoft-edge"
cask "mos"
cask "notion"
cask "parsec"
cask "pritunl"
cask "raycast"
cask "tableplus"
cask "telegram"
cask "tower"
cask "visual-studio-code"
cask "vlc"
mas "Audiobook Builder", id: 1437681957
mas "BetterSnapTool", id: 417375580
mas "Deliveries", id: 290986013
mas "NepTunes", id: 1006739057
mas "Tweetbot", id: 1384080005
