tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "colima"
brew "ctop"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "fish"
brew "fnm"
brew "gh"
brew "git"
brew "go"
brew "mas"
brew "mkcert"
brew "starship"
cask "1password"
cask "1password-cli"
cask "asset-catalog-tinkerer"
cask "discord"
cask "figma"
cask "firefox"
cask "font-metropolis"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "notion"
cask "parsec"
cask "steam"
cask "tableplus"
cask "telegram"
cask "the-unarchiver"
cask "tower"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "BetterSnapTool", id: 417375580
mas "ColorSlurp", id: 1287239339
mas "Deliveries", id: 290986013
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MidiKey", id: 492478362
mas "NepTunes", id: 1006739057
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tweetbot", id: 1384080005
